## Plan Result (prod-idp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_linux_virtual_machine.application
  * azurerm_linux_virtual_machine.trainer
  * module.idp-poc-db.azurerm_postgresql_active_directory_administrator.admin
  * module.idp-poc-db.azurerm_postgresql_database.postgres-db
* Update
  * module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_linux_virtual_machine.application will be created
  + resource "azurerm_linux_virtual_machine" "application" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "uksouth"
      + max_bid_price                   = -1
      + name                            = "idp-poc-application"
      + network_interface_ids           = [
          + "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Network/networkInterfaces/idp-poc-application-nic",
        ]
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "idp-poc-infra-prod"
      + size                            = "Standard_D8s_v3"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/idp-shared-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 100
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20_04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # azurerm_linux_virtual_machine.trainer will be created
  + resource "azurerm_linux_virtual_machine" "trainer" {
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = (known after apply)
      + disable_password_authentication = true
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "uksouth"
      + max_bid_price                   = -1
      + name                            = "idp-poc-trainer"
      + network_interface_ids           = [
          + "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.Network/networkInterfaces/idp-poc-trainer-nic",
        ]
      + patch_mode                      = "ImageDefault"
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "idp-poc-infra-prod"
      + size                            = "Standard_D16ds_v5"
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/idp-shared-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + virtual_machine_id              = (known after apply)

      + admin_ssh_key {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 100
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "20_04-LTS"
          + version   = "latest"
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.idp-kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/idp-poc-infra-prod/providers/Microsoft.KeyVault/vaults/idp-poc-prod|idp-poc-prod"
        name                       = "idp-poc-prod"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.idp-poc-db.azurerm_postgresql_active_directory_administrator.admin will be created
  + resource "azurerm_postgresql_active_directory_administrator" "admin" {
      + id                  = (known after apply)
      + login               = "DTS Platform Operations SC"
      + object_id           = "4d0554dd-fe60-424a-be9c-36636826d927"
      + resource_group_name = "cft-platform-idp-postgres-db-v11-data-prod"
      + server_name         = "cft-platform-idp-postgres-db-v11-prod"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idp-poc-db.azurerm_postgresql_database.postgres-db will be created
  + resource "azurerm_postgresql_database" "postgres-db" {
      + charset             = "utf8"
      + collation           = "en-GB"
      + id                  = (known after apply)
      + name                = "idppoc"
      + resource_group_name = "cft-platform-idp-postgres-db-v11-data-prod"
      + server_name         = "cft-platform-idp-postgres-db-v11-prod"
    }

  # module.idp-poc-db.null_resource.set-user-permissions[0] is tainted, so must be replaced
-/+ resource "null_resource" "set-user-permissions" {
      ~ id       = "4009526328915046163" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.idp-poc-db.azurerm_postgresql_database.postgres-db has been deleted
  - resource "azurerm_postgresql_database" "postgres-db" {
        id                  = "/subscriptions/a0939257-9c73-48ab-8daa-51cd49ef6c42/resourceGroups/cft-platform-idp-postgres-db-v11-data-prod/providers/Microsoft.DBforPostgreSQL/servers/cft-platform-idp-postgres-db-v11-prod/databases/idppoc"
      - name                = "idppoc" -> null
      - server_name         = "cft-platform-idp-postgres-db-v11-prod" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":9,"Program":"tfcmt","SHA1":"","Target":"prod-idp","Vars":{}} -->